[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/84/Spotify_icon.svg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "category": "Music & Audio",
    "description": "Spotify revolutionizes how you experience music by giving you instant access to millions of songs, podcasts, and audiobooks from around the world. Whether you’re into the latest pop hits, underground indie bands, or relaxing jazz, Spotify curates playlists tailored to your mood and listening habits. With personalized recommendations, you’ll constantly discover new artists and tracks that match your taste perfectly.\n\nBeyond streaming, Spotify lets you build and share playlists with friends or collaborate on them together in real-time. Its cross-device syncing ensures you can continue your listening session seamlessly whether you switch from your phone to your desktop or your smart speaker. Offline mode also ensures your favorite music follows you anywhere, even without an internet connection.\n\nFor artists, Spotify provides a direct connection to fans through features like Canvas visuals, lyrics sync, and behind-the-scenes content. Its design is sleek, responsive, and distraction-free, ensuring you focus on what matters most — the sound. With Spotify, music becomes not just something you listen to but something you live with every day.",
    "size": "145 MB",
    "reviews": "520K",
    "ratingAvg": 4.7,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 340000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "id": 2,
    "category": "Social Media",
    "description": "Instagram has evolved into one of the most dynamic platforms for visual storytelling. It allows users to capture, share, and explore life’s moments through photos, videos, and stories. The app offers a creative suite of filters, editing tools, and AR effects that make your content look professional and expressive. Its sleek, minimalist interface helps you focus on what matters — authentic connection through visuals.\n\nBeyond personal sharing, Instagram is a thriving ecosystem for creators, influencers, and brands. With Reels, IGTV, and Live sessions, users can reach millions and engage in real-time. Businesses can set up professional profiles, sell directly through in-app shops, and track engagement metrics through detailed analytics tools.\n\nThe app’s algorithm curates content based on your preferences, making discovery effortless. From fashion inspiration and travel photography to tutorials and memes, Instagram connects communities across every niche imaginable. Whether you’re growing a brand or simply sharing your daily life, it’s a visual platform built for connection and creativity.",
    "size": "210 MB",
    "reviews": "800K",
    "ratingAvg": 4.5,
    "downloads": "150M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 455000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/b8/YouTube_Logo_2017.svg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 3,
    "category": "Entertainment",
    "description": "YouTube is the world’s largest platform for video discovery, creation, and entertainment. It empowers anyone to share ideas and stories with a global audience. From short clips to feature-length documentaries, tutorials, music videos, and vlogs — there’s content for every interest imaginable. Its algorithm learns from your viewing patterns to recommend videos you’ll genuinely enjoy.\n\nCreators can upload videos, manage channels, and interact with audiences through comments, community posts, and live streams. YouTube Studio offers powerful analytics to track performance, helping creators grow their audience strategically. The YouTube Premium plan also allows ad-free viewing, offline downloads, and background playback.\n\nWhether you’re learning a new skill, following your favorite artist, or binge-watching educational content, YouTube adapts to your routine. It’s a hub of creativity and knowledge that continues to redefine how the world consumes video content — anytime, anywhere.",
    "size": "180 MB",
    "reviews": "1M",
    "ratingAvg": 4.6,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 570000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Facebook_icon.svg",
    "title": "Facebook",
    "companyName": "Meta Platforms",
    "id": 4,
    "category": "Social Media",
    "description": "Facebook remains the largest social platform connecting billions of users across the globe. It provides a space to share updates, photos, and memories while staying in touch with friends and communities. Through posts, groups, and events, users can engage in conversations that matter most to them.\n\nBeyond personal networking, Facebook offers robust tools for businesses and creators. Pages, Marketplace, and Ads Manager help users promote products and ideas effectively. With live streaming, reels, and stories, the platform encourages authentic, real-time interaction.\n\nFacebook’s intelligent algorithm tailors your feed to your interests, making your social experience personal and engaging. Its privacy controls give you the power to decide who sees what you share. Whether you’re reconnecting with an old friend, joining a community, or running a business, Facebook brings the digital world closer together.",
    "size": "275 MB",
    "reviews": "750K",
    "ratingAvg": 4.3,
    "downloads": "180M",
    "ratings": [
      { "name": "1 star", "count": 35000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 445000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms",
    "id": 5,
    "category": "Communication",
    "description": "WhatsApp simplifies global communication by offering free, secure messaging and calling on any device. It’s built on end-to-end encryption, ensuring that only you and your contacts can read what’s shared. Whether sending text messages, voice notes, photos, or videos, WhatsApp makes every interaction fast and private.\n\nGroup chats, video calls, and status updates make staying in touch with family and friends effortless. Businesses use WhatsApp Business to connect with customers, send updates, and manage support efficiently. The desktop and web versions ensure a seamless experience across platforms.\n\nThe interface is minimal yet functional, letting users focus on connection rather than complexity. With features like disappearing messages and chat backups, WhatsApp combines privacy, reliability, and ease of use — making it the world’s go-to messaging app.",
    "size": "120 MB",
    "reviews": "900K",
    "ratingAvg": 4.8,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 685000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Google_Maps_icon_%282020%29.svg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 6,
    "category": "Navigation",
    "description": "Google Maps is your personal navigation assistant, guiding you anywhere with real-time accuracy. It combines satellite imagery, traffic data, and local business information to make travel efficient and informed. Whether driving, walking, or using public transport, the app provides optimized routes and estimated arrival times.\n\nYou can explore restaurants, gas stations, and landmarks around you, complete with ratings, reviews, and photos. Offline maps ensure you’re never lost, even in areas without connectivity. Street View gives you an immersive experience of any location worldwide.\n\nFor businesses and travelers alike, Google Maps is an indispensable companion. With voice-guided navigation, trip history, and live location sharing, it keeps you connected, safe, and always on the right track.",
    "size": "250 MB",
    "reviews": "650K",
    "ratingAvg": 4.4,
    "downloads": "120M",
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 435000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/12/Google_Photos_icon_%282020%29.svg",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 7,
    "category": "Photography",
    "description": "Google Photos keeps your memories safe, organized, and easy to rediscover. It automatically backs up your photos and videos to the cloud, freeing up space on your device. Intelligent AI categorizes content by people, places, and objects, making searching for specific memories incredibly fast.\n\nThe app includes advanced editing tools powered by machine learning. Features like Magic Eraser, auto color correction, and cinematic effects help transform ordinary photos into professional-looking images. Sharing is effortless — create shared albums or links that update in real time.\n\nWith its cross-device syncing, you can access your photos anywhere. Google Photos turns your gallery into a living archive, celebrating life’s best moments while keeping them beautifully organized and secure.",
    "size": "190 MB",
    "reviews": "500K",
    "ratingAvg": 4.5,
    "downloads": "90M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 130000 },
      { "name": "5 star", "count": 315000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/77/Wikipedia_svg_logo.svg",
    "title": "Wikipedia",
    "companyName": "Wikimedia Foundation",
    "id": 8,
    "category": "Education",
    "description": "Wikipedia is the world’s largest free encyclopedia, written and maintained by volunteers. It offers millions of articles in multiple languages covering every subject imaginable. The app brings that vast library of knowledge to your fingertips with a clean, distraction-free reading experience.\n\nOffline reading allows you to save articles for later, while features like dark mode, quick search, and text resizing enhance accessibility. Users can contribute directly by editing articles or adding citations, ensuring the content remains accurate and up to date.\n\nWikipedia’s minimal design focuses on what matters most — learning. It’s more than just an encyclopedia; it’s a global movement for open knowledge, empowering anyone to explore and share the world’s information freely.",
    "size": "85 MB",
    "reviews": "300K",
    "ratingAvg": 4.2,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 70000 },
      { "name": "5 star", "count": 200000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/01/LinkedIn_Logo.svg",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 9,
    "category": "Business",
    "description": "LinkedIn is the world’s largest professional network, helping people connect, grow, and find new opportunities. Whether you’re seeking a new job, showcasing your experience, or learning new skills, LinkedIn provides the tools to build your professional identity online.\n\nThe app enables real-time messaging, job alerts, and industry insights from thought leaders. Recruiters can post openings, and candidates can apply directly with their LinkedIn profiles. Learning modules help users gain certifications and strengthen their expertise.\n\nIts clean design and algorithm-driven feed make it easy to stay updated on professional news. LinkedIn transforms networking from a formality into a daily habit, empowering you to shape your career with confidence and clarity.",
    "size": "160 MB",
    "reviews": "400K",
    "ratingAvg": 4.0,
    "downloads": "80M",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 100000 },
      { "name": "5 star", "count": 255000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Logo_of_Twitter.svg",
    "title": "Twitter",
    "companyName": "X Corp",
    "id": 10,
    "category": "News & Discussion",
    "description": "Twitter (now X) is the pulse of the internet — a platform for real-time thoughts, trends, and conversations. It enables users to share short posts, photos, and videos, and engage directly with people worldwide. From breaking news to viral memes, Twitter captures what’s happening right now.\n\nIts algorithmic timeline highlights topics you care about most. Spaces allow for live audio conversations, while Communities help users connect around shared interests. Verified accounts, bookmarks, and advanced search tools make navigating discussions seamless.\n\nWhether you’re a creator, journalist, or everyday user, Twitter offers an open stage for ideas. It’s fast, conversational, and ever-evolving — shaping public dialogue in ways few platforms can match.",
    "size": "130 MB",
    "reviews": "600K",
    "ratingAvg": 4.1,
    "downloads": "110M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 330000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Apple_logo_black.svg",
    "title": "Apple Store",
    "companyName": "Apple Inc",
    "id": 11,
    "category": "Shopping",
    "description": "The Apple Store app is your gateway to everything Apple. It lets you shop for the latest products, schedule Genius Bar appointments, and get personalized recommendations based on your device history. Every product page is beautifully designed, offering detailed specs, comparisons, and interactive previews.\n\nThe app makes checkout simple with Apple Pay integration and order tracking. You can customize your Mac, iPhone, or iPad right from the app and pick it up at your nearest Apple Store or get it delivered. Notifications keep you updated about shipping, availability, and upcoming launches.\n\nWith its smooth animations and clean interface, the Apple Store app embodies Apple’s design philosophy — elegant, functional, and intuitive. It transforms shopping for tech into an inspiring, premium experience.",
    "size": "1.2 GB",
    "reviews": "250K",
    "ratingAvg": 4.3,
    "downloads": "60M",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 160000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/71/Google_Play_2016_logo.svg",
    "title": "Google Play",
    "companyName": "Google LLC",
    "id": 12,
    "category": "Utilities",
    "description": "Google Play is Android’s official hub for apps, games, movies, books, and more. It provides a secure and curated marketplace that serves billions of users worldwide. Each app and game is verified through Play Protect, ensuring safety and quality with every download.\n\nThe platform features personalized recommendations, editor’s picks, and early access programs. Users can track app performance, manage subscriptions, and leave reviews directly within the app. With Play Points, Google turns everyday purchases into rewards for discounts and perks.\n\nGoogle Play’s intuitive design and seamless integration with Android devices make discovering and managing digital content effortless. It’s more than just a store; it’s a gateway to the best of what Android has to offer.",
    "size": "290 MB",
    "reviews": "300K",
    "ratingAvg": 4.4,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 12000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 18000 },
      { "name": "4 star", "count": 80000 },
      { "name": "5 star", "count": 183000 }
    ]
  }
]
